{
    "allSummaries": [
        "Science is the search for truth through repeated experiment and observation ",
        "Deductive reasoning starts with a generalization and uses the generalization to interpret the data in a specific case",
        "Inductive Reasoning begins with individual observations and uses the observations to develop generalizations ",
        "Occam’s Razor Logic said in choosing between opposing hypotheses, we prefer the simpler one.",
        "Philosophy is the study of general and fundamental problems.",
        "Ethics is the discipline that concerned with the questions of how one should live.",
        "Metaphysics is concerned with what sorts of things exist and what are their essential natures.",
        "Epistemology is concerned with what counts as genuine knowledge",
        "Logic is concerned with what are the correct principles of reasoning.",
        "Epistemology is a Branch of philosophy is concerned with nature and scope of knowledge.",
        "Logic is a Branch of philosophy is concerned with the study of the principles of valid inference and correct reasoning.",
        "Metaphysics is a Branch of philosophy is concerned with the study of the most general features of reality.",
        "Ethics is a Branch of philosophy is concerned with questions of how people ought to act, and the search for a definition of right conduct and the good life.",
        "Ethos is the Greek word for ethics.",
        "Prescriptive Ethics asks questions on how people should act.",
        "Applied Ethics asks questions on how we take moral knowledge and put it into practice.",
        "Meta-Ethics asks questions on what does right even mean.",
        "Skepticism questions the possibility of obtaining any sort of knowledge.",
        "Sextus Empiricus describes the skepticism as an ability to place antithesis, in any manner whatever, appearances and judgments, and thus to come first of all to a suspension of judgment and then to mental tranquility.",
        "Pyrrho believed everything could be doubted except appearances.",
        "David Hume argued that there are only two kinds of reasoning (Deductive and inductive).",
        "Rationalism is the view that emphasis on reasoning as a source of knowledge.",
        "Parmenides is the first rationalist.",
        "Parmenides argued that it is impossible to doubt that thinking actually occurs.",
        "Zeno of Elea was the disciple of Parmenides.",
        "Zeno of Elea argued that motion is impossible, since the assertion that it exists implies a contradiction.",
        "Idealism is the epistemological doctrine that nothing can be directly known outside of the minds of thinking beings.",
        "Idealism is the metaphysical doctrine that nothing exists apart from the minds and the contents of the mind.",
        "Subjective idealism describes objects as no more than collections or bundles of sense data in the perceiver.",
        "George Berkeley is the first prominent western idealist in the metaphysical sense.",
        "George Berkeley argued that there is no deep distinction between mental states, such as feeling pain, and the ideas about so-called external things that appears to us through the senses.",
        "Immanuel Kant and Karl Marx were the disciple of Berkeley.",
        "Realism is a school of thought that some things exists have real existence outside the mind.",
        "Henrick Ibsen is the father of realism.",
        "Pragmatism is a philosophical movement that includes those who claim that an ideology or proposition is to be found in the practical consequences of accepting it, and that unpractical ideas are to be rejected.",
        "Charles Sanders Peirce and William James are the founder of pragmatism.",
        "Existentialism is a philosophy that emphasizes individual existence, freedom and choice, where humans can define their own meaning in life, and try to make rational decisions despite existing in an irrational universe.",
        "Soren Kierkegaard is the father of existentialism.",
        "Empiricism is the theory that all knowledge is based on experience derived from the senses.",
        "John Locke, George Berkeley and David Hume were the proponent of empiricism.",
        "Edmund Husserl and Martin Hedegger developed phenomenology.",
        "Dobshansky wrote that nothing make sense in the life sciences except in the light of Evolution",
        "Science began in Mesopotamia, Egypt and Asia Minor",
        "Science started with individual thinking about the structure of the universe",
        "Socrates was an Athenian",
        "Thales is the founder of Greek philosophy",
        "Thales thought the earth was flat and floated on water",
        "Thales believed that water is the source of all things",
        "Anaximenes believed that matter is composed of air",
        "Anaximander said everything in existence originated from an unspecified boundless stuff",
        "Anaximander was the first speculative astronomer and the history of written Greek philosophy started with him in Asia Minor",
        "Socrates set the standard for all subsequent western philosophy",
        "The Hellenistic were interested in both human conducts(morality) and the structure of the universe(cosmos)",
        "Plato had no faith in the senses because he believed they are not reliable. He had faith only in the intellect and believed the mind could be trained to lead us to truth",
        "Plato believed the planets moved in perfect circles (perfect orbit).",
        "Geocentric model is the believe that the earth is the centre of the universe because of God\"s special concern for humankind",
        "Eudoxos presented a mathematical model of the planetary motion in favour of the geocentric model",
        "Aristotle posited that the earth is made of hard physical spheres (Crystalline).",
        "Heraclides suggested the earth rotates on its axis",
        "Aristarchus suggested that the sun and the stars are fixed and motionless and the earth and other planet rotate around the sun, with the earth circling the sun once a year.",
        "Ptolemy believed in geocentric cosmology and also believed that the earth was stationary, otherwise if it rotates, objects would fall off and birds will not keep-up.",
        "The Dark Ages is a period of cultural decline or societal collapse that took place in Western Europe between the fall of Rome and the eventual recovery of learning",
        "During the Renaissance many original Greek manuscripts were translated.",
        "A person who is clever at a great number of things is sometimes called a Renaissance man",
        "The most famous Renaissance Man is Leonardo da Vinci",
        "The Renaissance started in Italy",
        "In 1423 the first printed books were made in Europe",
        "Early 1300s, the first guns.",
        "1618, William Harvey said that the blood was pumped by the heart",
        "1480s, Leonardo da Vinci studies human anatomy.",
        "1382, the bible first translated from Latin into English by John Wycliffe",
        "1517, Martin Luther nailed 95 Theses (ideas for discussion about problems in the church) on the door of Wittenberg Castle",
        "1534, Henry VIII broke the church of England from the Roman Catholic Church",
        "Interpretation of nature and events based on emprical data is termed Naturalistic philosophy.",
        "Evolution is a theory in biology postulating that the various types of plants, animals, and other living things on Earth have their origin in other preexistin types and that the distinguishable differences are due to modifications in successive generations",
        "Naturalistic evolution is the position of acceptance of biological eveolution and metaphysical naturalism and rejecting theistic evolution.",
        "Compte de Buffon recognized the evidence of variability of organic forms. He anticipated partially, the concept of natural selection and the struggle for survival",
        "Wells suggested that new forms arise by chance variations",
        "Lamarck said that plants and animals interact with their environment and changes result from Inheritance of acquired characteristics, use and disuse of parts",
        "Fossils is any evidence of life from the remote past",
        "Paleontologist are the names of scientists who studies fossils",
        "Paleontology is the study of fossils",
        "Edward Drinker Cope and Othniel Charles Marsh are the Pioneers of American Vertebrate Paleontology",
        "The most common preserving media fine grained sediments, volcanic ash, swamp water, peat bog waters, ice, resin",
        "Fossils are not the remains of the organism itself! They are rocks",
        "Preserved remains become fossils if they reach an age of about 10,000 years",
        "Fossilization is the process of remains becoming fossils",
        "Geologic Column refers to a composite columnar representation of what would be the complete sequence of rock units in earth’s crust",
        "Precambrian and Phanerozoic Layers are the two layers of the geologic column",
        "Archean and Proterozoic layer are the names of the divisions of the Precambrian layer",
        "Fossils of organisms in the archean layer are extremely rare compared to Proterozoic",
        "Paleozoic, Mesozoic, Cenozoic are the names of the divisions of the Phanerozoic",
        "Fossils of the organisms in the Phanerozoic layer are relatively abundant",
        "Fossils are mostly found in the sedimentary rocks and few are found in the igneous rock",
        "No record of fossils is being found in the metamorphic rocks",
        "Dating is a technique used to characterize materials (organic or inorganic specifically to establish their relative or absolute ages",
        "Sediment is dirt, clay, sand and soil that the organism gets covered with",
        "Sedimentary fossils are formed when Organism dies and becomes buried under sediment, then the Organism gradually decomposes and leaves a hollow impression or mold in the sediment and Over a LONG PERIOD OF TIME the mold gills in with sediment which makes a cast of the organism",
        " Relative and Absolute Dating are the types of Dating",
        "Ice cores are obtained by drilling core samples of ice in glaciated regions",
        "Ice cores is used to determine the age of ice",
        "Stratigraphy is used to determine the age of strata",
        "Dendrochronology is a technique for dating past climatic changes through a study of tree ring growth",
        "Dendrochronology is used to know the ages of trees and objects made from wood",
        "Thermo luminescence is used for dating inorganic materials",
        "Obsidian hydration is a geochemical method of determining ages of artifacts made of obsidian",
        "Varve analysis is a form of dating in which sedimentary layers showing distinct texture or color for different seasons within a single year are being counted like tree rings",
        "Radiometric age dating is the process of determining the ages of rocks, minerals and other geologic materials by measuring radioactive elements and the daughter isotopes in these materials"
    ]
}